# For titanic dataset :

1. How many male and Female passengers
2. How many survived
3. How many casuality
4. what is the name of the person who is the eldest one
5. How many passenger do we have in first second and third class
6. How many do we have whose name starts with 's'
7. Try to create a new column which is a summation of "sibsp" and "Parch"
8. How many person do we have below age of 25
9. How many person dies whose age was less than 40
10. From a cabin column seperate text and numeric value

In [1]:
import pandas as pd

In [2]:
#Read the file
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [5]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [6]:
#1.How many male and Female passengers
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [7]:
#2.How many survived
df[df['Survived'] == 1]['Survived'].count()

342

In [8]:
#3.How many casuality
df[df['Survived'] == 0]['Survived'].count()

549

In [9]:
#4. what is the name of the person who is the eldest one
df[df['Age'] == df['Age'].max() ][['Name','Age']]

                                     Name   Age
630  Barkworth, Mr. Algernon Henry Wilson  80.0

In [10]:
#5. How many passenger do we have in first second and third class
df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [11]:
#6. How many do we have whose name starts with 's'
df[df['Name'].str.startswith('S',na = False)]['Name'].count()

86

In [12]:
#7. Try to create a new column which is a summation of "sibsp" and "Parch"
df['sum'] = df[['SibSp','Parch']].sum(axis=1)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sum
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

In [13]:
#8. How many person do we have below age of 25
df[df['Age'] < 25]['Age'].count()

278

In [14]:
#9. How many person dies whose age was less than 40
df[(df['Age'] < 40) & (df['Survived'] == 0)]['Survived'].count()

322

In [15]:
#10. From a cabin column seperate text and numeric value
df['cabin_Number'] = df['Cabin'].str.replace('([A-Za-z]+)', '')
df['cabin_Letter'] = df['Cabin'].str.extract('([A-Za-z]+)')

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked  sum cabin_Number  \
0      0         A/5 21171   7.2500   NaN        S    1          NaN
1      0          PC 17599  71.2833   C85        C    1           85
2      0  STON/O2. 3101282   7.9250   NaN        S    0          NaN
3      0            113803  53.1000  C123        S    1          123
4      0            373450   8.0500   NaN        S    0          NaN

  cabin_Letter
0          NaN
1            C
2          NaN
3            C
4          NaN

<ipython-input-15-d4b1e039a063>:2: FutureWarning: The default value of regex will change from True to False in a future version.
  df['cabin_Number'] = df['Cabin'].str.replace('([A-Za-z]+)', '')

In [16]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sum,cabin_Number,cabin_Letter
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,NaN,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,123,C
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,NaN,NaN

# For Bank Marketing Dataset:

1. How many campaign available in this dataset
2. How many users do we have with housing and personal loan
3. how many person do we have whose age is 60+
4. In which month we have targeted most of the customer
5. Which mode of call is giving you more result
6. How many Enterprenuers do we have in the list
7. How many customers do we have with negative balance
8. Prepare a group of data based on Education level

In [33]:
df1 = pd.read_csv(r'D:\bank\bank.csv',sep=';')

In [34]:
#1. How many campaign available in this dataset
len(df1['campaign'].unique())

32

In [35]:
#2. How many users do we have with housing and personal loan
#if persons having both the loadn
print(df1[(df1['housing'] == 'yes') & (df1['loan'] == 'yes')]['housing'].count())
#if either one is having
print(df1[(df1['housing'] == 'yes') | (df1['loan'] == 'yes')]['housing'].count())

406
2844

In [36]:
#3. how many person do we have whose age is 60+
df1[df1['age'] >= 60]['age'].count()

174

In [37]:
# 4. In which month we have targeted most of the customer
df1['month'].value_counts().index[0]

'may'

In [38]:
#5. Which mode of call is giving you more result
df1[df1['poutcome']=='success']['contact'].value_counts()

cellular     114
telephone     13
unknown        2
Name: contact, dtype: int64

In [39]:
#6. How many Enterprenuers do we have in the list
df1[df1['job']=='entrepreneur']['job'].count()

168

In [40]:
#7.How many customers do we have with negative balance
df1[df1['balance']<0]['balance'].count()

366

In [41]:
#8. Prepare a group of data based on Education level
education_list = df1['education'].unique()

In [42]:
education_list

array(['primary', 'secondary', 'tertiary', 'unknown'], dtype=object)

In [47]:
grouped = df1.groupby('education')

In [48]:
df_primary = grouped.get_group('primary')
df_secondary = grouped.get_group('secondary')
df_tertiary = grouped.get_group('tertiary')
df_unknown = grouped.get_group('unknown')

In [51]:
print(df_primary.head())
print("********************************************************************************")
print(df_secondary.head())
print("********************************************************************************")
print(df_tertiary.head())
print("********************************************************************************")
print(df_unknown.head())

    age          job   marital education default  balance housing loan  \
0    30   unemployed   married   primary      no     1787      no   no
9    43     services   married   primary      no      -88     yes  yes
18   25  blue-collar    single   primary      no     -221     yes   no
26   55  blue-collar   married   primary      no      627     yes   no
36   78      retired  divorced   primary      no      229      no   no

      contact  day month  duration  campaign  pdays  previous poutcome    y
0    cellular   19   oct        79         1     -1         0  unknown   no
9    cellular   17   apr       313         1    147         2  failure   no
18    unknown   23   may       250         1     -1         0  unknown   no
26    unknown    5   may       247         1     -1         0  unknown   no
36  telephone   22   oct        97         1     -1         0  unknown  yes
********************************************************************************
    age          job  marital  education default  balance housing loan  \
1    33     services  married  secondary      no     4789     yes  yes
4    59  blue-collar  married  secondary      no        0     yes   no
7    39   technician  married  secondary      no      147     yes   no
10   39     services  married  secondary      no     9374     yes   no
11   43       admin.  married  secondary      no      264     yes   no

     contact  day month  duration  campaign  pdays  previous poutcome   y
1   cellular   11   may       220         1    339         4  failure  no
4    unknown    5   may       226         1     -1         0  unknown  no
7   cellular    6   may       151         2     -1         0  unknown  no
10   unknown   20   may       273         1     -1         0  unknown  no
11  cellular   17   apr       113         2     -1         0  unknown  no
********************************************************************************
   age            job  marital education default  balance housing loan  \
2   35     management   single  tertiary      no     1350     yes   no
3   30     management  married  tertiary      no     1476     yes  yes
5   35     management   single  tertiary      no      747      no   no
6   36  self-employed  married  tertiary      no      307     yes   no
8   41   entrepreneur  married  tertiary      no      221     yes   no

    contact  day month  duration  campaign  pdays  previous poutcome   y
2  cellular   16   apr       185         1    330         1  failure  no
3   unknown    3   jun       199         4     -1         0  unknown  no
5  cellular   23   feb       141         2    176         3  failure  no
6  cellular   14   may       341         1    330         2    other  no
8   unknown   14   may        57         2     -1         0  unknown  no
********************************************************************************
     age          job   marital education default  balance housing loan  \
20    38   management  divorced   unknown      no        0     yes   no
27    67      retired   married   unknown      no      696      no   no
49    61       admin.   married   unknown      no     4629     yes   no
132   43  blue-collar   married   unknown     yes     -715     yes   no
133   48       admin.   married   unknown      no        0     yes   no

       contact  day month  duration  campaign  pdays  previous poutcome    y
20    cellular   18   nov        96         2     -1         0  unknown   no
27   telephone   17   aug       119         1    105         2  failure   no
49    cellular   27   jan       181         1     92         1  success  yes
132    unknown   30   may        67         3     -1         0  unknown   no
133   cellular    8   may        85         1    168         2  failure   no